Ran Plan for 4 projects:

1. project: `setof-commerce-ecr-prod` dir: `terraform/ecr` workspace: `default`
1. project: `setof-commerce-ecs-cluster-prod` dir: `terraform/ecs-cluster` workspace: `default`
1. project: `setof-commerce-elasticache-prod` dir: `terraform/elasticache` workspace: `default`
1. project: `setof-commerce-ecs-web-api-prod` dir: `terraform/ecs-web-api` workspace: `default`
---

### 1. project: `setof-commerce-ecr-prod` dir: `terraform/ecr` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p setof-commerce-ecr-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252Fsetof-commerce%252Fterraform%252Fecr%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p setof-commerce-ecr-prod
  ```

---
### 2. project: `setof-commerce-ecs-cluster-prod` dir: `terraform/ecs-cluster` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p setof-commerce-ecs-cluster-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252Fsetof-commerce%252Fterraform%252Fecs-cluster%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p setof-commerce-ecs-cluster-prod
  ```

---
### 3. project: `setof-commerce-elasticache-prod` dir: `terraform/elasticache` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.redis.aws_cloudwatch_metric_alarm.connections[0] will be created
+ resource "aws_cloudwatch_metric_alarm" "connections" {
      + actions_enabled                       = true
      + alarm_description                     = "ElastiCache setof-commerce-redis-prod - Connection count is too high"
      + alarm_name                            = "setof-commerce-redis-prod-connection-count"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "CacheClusterId" = "setof-commerce-redis-prod"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CurrConnections"
      + namespace                             = "AWS/ElastiCache"
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-redis-prod-connections-alarm"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-redis"
        }
      + tags_all                              = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-redis-prod-connections-alarm"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-redis"
        }
      + threshold                             = 1000
      + treat_missing_data                    = "notBreaching"
    }

  # module.redis.aws_cloudwatch_metric_alarm.cpu[0] will be created
+ resource "aws_cloudwatch_metric_alarm" "cpu" {
      + actions_enabled                       = true
      + alarm_description                     = "ElastiCache setof-commerce-redis-prod - CPU utilization is too high"
      + alarm_name                            = "setof-commerce-redis-prod-cpu-utilization"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "CacheClusterId" = "setof-commerce-redis-prod"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ElastiCache"
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-redis-prod-cpu-alarm"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-redis"
        }
      + tags_all                              = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-redis-prod-cpu-alarm"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-redis"
        }
      + threshold                             = 80
      + treat_missing_data                    = "notBreaching"
    }

  # module.redis.aws_cloudwatch_metric_alarm.memory[0] will be created
+ resource "aws_cloudwatch_metric_alarm" "memory" {
      + actions_enabled                       = true
      + alarm_description                     = "ElastiCache setof-commerce-redis-prod - Memory utilization is too high"
      + alarm_name                            = "setof-commerce-redis-prod-memory-utilization"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "CacheClusterId" = "setof-commerce-redis-prod"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "DatabaseMemoryUsagePercentage"
      + namespace                             = "AWS/ElastiCache"
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-redis-prod-memory-alarm"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-redis"
        }
      + tags_all                              = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-redis-prod-memory-alarm"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-redis"
        }
      + threshold                             = 85
      + treat_missing_data                    = "notBreaching"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p setof-commerce-elasticache-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252Fsetof-commerce%252Fterraform%252Felasticache%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p setof-commerce-elasticache-prod
  ```
Plan: 3 to add, 0 to change, 0 to destroy.

---
### 4. project: `setof-commerce-ecs-web-api-prod` dir: `terraform/ecs-web-api` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p setof-commerce-ecs-web-api-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252Fsetof-commerce%252Fterraform%252Fecs-web-api%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p setof-commerce-ecs-web-api-prod
  ```

---
### Plan Summary

4 projects, 1 with changes, 3 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```